app/controllers/characters_controller.rb

SELECT "characters".* FROM "characters"
---
    def index
        characters = Character.all

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        character = Character.find(params[:id])