app/controllers/finds_controller.rb

SELECT "finds".* FROM "finds"
---
    def index
        finds = Find.all

INSERT INTO "finds" ("character_id", "nerd_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["character_id", 5], ["nerd_id", 14], ["created_at", "2021-06-02 18:47:43.216379"], ["updated_at", "2021-06-02 18:47:43.216379"]]
---
    def create
        find = Find.new(find_params)

        if find.valid?
            find.save