app/controllers/nerds_controller.rb

    def find_nerd
        @nerd = Nerd.find(params[:id])
---
SELECT "nerds".* FROM "nerds" WHERE "nerds"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]