app/controllers/nerds_controller.rb

    def index
        nerds = Nerd.all
---
SELECT "nerds".* FROM "nerds"

    def create
        nerd = Nerd.new(params.permit(:name, :age, :state, :username, :password))

        if nerd.valid?
            nerd.save
---
INSERT INTO "nerds" ("name", "age", "state", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def login
        nerd = Nerd.find_by(username: params[:username])
---
SELECT "nerds".* FROM "nerds" WHERE "nerds"."username" = ? LIMIT ?  [["username", "akmcbride"], ["LIMIT", 1]]

    def destroy
        @nerd.finds.destroy_all
        @nerd.destroy
---
DELETE FROM "finds" WHERE "finds"."id" = ?  [["id", 1]]
DELETE FROM "nerds" WHERE "nerds"."id" = ?  [["id", 13]]
SELECT "finds".* FROM "finds" WHERE "finds"."nerd_id" = ?  [["nerd_id", 24]]
DELETE FROM "nerds" WHERE "nerds"."id" = ?  [["id", 24]]

    def find_nerd
        @nerd = Nerd.find(params[:id])
---
SELECT "nerds".* FROM "nerds" WHERE "nerds"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]