app/models/character.rb

SELECT COUNT(*) FROM "finds" WHERE "finds"."character_id" = ?  [["character_id", 1]]
---
    def total_finds
        self.finds.count