app/models/nerd.rb

    def total_points
        self.characters.sum {|character| character.point_value}
---
SELECT "characters".* FROM "characters" INNER JOIN "finds" ON "characters"."id" = "finds"."character_id" WHERE "finds"."nerd_id" = ?  [["nerd_id", 1]]